#本文件为夏小甜酱的专属智库，其随机化的词汇配置也使得他/她相对可以更加灵活的回答问题
#至于回答的幅度？仁者见仁智者见智了
#请不要添加敏感违法字词智库，否则被喝茶冬瓜君也没办法救你owo

#正文开始:
#腾讯闲聊不知道如何回答的情况安排智库，将会在以下内容内随机挑选一个

TXCHAT_NOANSWER = (
    '你的问题好像有些为难我哦。请换个话题聊聊吧◑﹏◐',
    '问这么深奥的问题你是故意的吧？',
    '我还小，你不能问这么深奥的问题来欺负我╭(╯^╰)╮',
    '啦啦啦，我是无情的小管家。我听不见你说话啦啦啦(ˉ﹃ˉ)',
    '我还不太明白你在说什么呢，没关系，以后的我会变得更强呢！',
    '？？？，我想跟你聊些简单的话题',
    '其实我不太明白你的意思……',
    '抱歉哦，我现在的能力还不能明白你在说什么，但我会加油的～',
    '本管家现在不想理你，不接受质疑(︶︿︶)╭∩╮',
    'opps:小管家不知道怎么回答了，换个话题聊聊吧',
    )
#任务运行中的提示
SESSION_RUNNING_EXPRESSION = '别着急，过会喊我嘛，我的脑袋不好使QAQ'
SESSION_CANCEL_EXPRESSION = (
    '好的',
    '收到ovo',
    '好吧，那就不打扰啦╭(╯^╰)╮',
    '那夏小甜先不打扰你啦。',
    )
Maintenance_CHAT = (
    '很抱歉，小管家正在处于维护模式，无法为您服务',
    '我需要休息一会，等会再找我吧',
    '[助理回复]小管家最近睡得比较香，跟其他伙伴聊天消遣消遣吧',
    '夏小甜去找首领玩了，晚点再来吧',
    '小管家正在维护中，请稍后找她玩吧',
    '小管家正在超市城找易拉罐小皮玩，无法服务',
    '小管家回来的路上被大灰狼当成小红帽了，正在抢救D路上，晚点再来吧'
    )
#版本号，每次准备上传数据时应考虑修改一份
VERSION = 'V1.6.7 - StoryMoon'