#本文件为夏小甜酱的专属智库，其随机化的词汇配置也使得他/她相对可以更加灵活的回答问题
#至于回答的幅度？仁者见仁智者见智了
#请不要添加敏感违法字词智库，否则被喝茶冬瓜君也没办法救你owo

#正文开始:
#腾讯闲聊不知道如何回答的情况安排智库，将会在以下内容内随机挑选一个
txchat_voice = (
    '[CQ:face,id=39][CQ:face,id=39]我是外星人，听不懂普通话！！！',
    '你说的我真的听不懂啦，可以打字跟我交流吗？',
    '遇见你真好，可惜我听不懂中文[CQ:face,id=203][CQ:face,id=203]',
    'You Can type font ? '
    )
TXCHAT_NOANSWER = (
    '你的问题好像有些为难我哦。请换个话题聊聊吧◑﹏◐',
    '问这么深奥的问题你是故意的吧？',
    '我还小，你不能问这么深奥的问题来欺负我╭(╯^╰)╮',
    '啦啦啦，我是无情的小管家。我听不见你说话啦啦啦(ˉ﹃ˉ)',
    '我还不太明白你在说什么呢，没关系，以后的我会变得更强呢！',
    '？？？，我想跟你聊些简单的话题',
    '其实我不太明白你的意思……',
    '抱歉哦，我现在的能力还不能明白你在说什么，但我会加油的～',
    '本管家现在不想理你，不接受质疑(︶︿︶)╭∩╮',
    'opps:小管家不知道怎么回答了，换个话题聊聊吧',
    '我听说我们的关系就像星星和天空的关系一样呢(＠￣ー￣＠)',
    '和自己的心站在一起，而不是恐惧、悲伤、失落、无力、愤怒、掩饰。勇敢。',
    '彼岸花花开彼岸，断肠草草断肝肠'
    )
#任务运行中的提示
SESSION_RUNNING_EXPRESSION = '别着急，过会喊我嘛，我的脑袋不好使QAQ'
SESSION_CANCEL_EXPRESSION = (
    '好的',
    '收到ovo',
    '好吧，那就不打扰啦╭(╯^╰)╮',
    '那夏小甜先不打扰你啦。',
    )
Maintenance_CHAT = (
    '很抱歉，小管家正在处于维护模式，无法为您服务',
    '我需要休息一会，等会再找我吧',
    '[助理回复]小管家最近睡得比较香，跟其他伙伴聊天消遣消遣吧',
    '夏小甜去找首领玩了，晚点再来吧',
    '小管家正在维护中，请稍后找她玩吧',
    '小管家正在超市城找易拉罐小皮玩，无法服务',
    '小管家回来的路上被大灰狼当成小红帽了，正在抢救D路上，晚点再来吧',
    '喜迎建党100周年，小管家7月1日23点前出门休假了，带来不便，敬请谅解'
    )
#版本号，每次准备上传数据时应考虑修改一份
VERSION = 'V1.6.7 - StoryMoon'
#本智库用于存放插件类提示信息，请留意
#查询类等待提醒
SYSTEM_WAITING =(
    '受网络影响查询时间可能较长，请稍候哦◑﹏◐',
    '稍等一会，马上就好',
    '虽然我的能力不大，但是这个小要求不难，请等我一小会╭(╯^╰)╮',
    '让我来帮你查查看',
    '天灵灵，地灵灵，网速现在快显灵owo',
    '今天天气怎么样呀？我也想出去散散步',
    '给我一点时间，还你一个惊喜owo',
    'emmmmmm',
    'A future without a future is not the future I want (o_ _))',
    '我知道你喜欢干净利落，不过告诉你在加载中总比你苦苦等待Bug好'
    )
APP_FOOLSHIT =(
    '我讨厌木头人，',
    '',
    'emmmmmm，',
    '2333333，',
    '让你久等了，',
    '结果有点小惊喜，'
)
mbid=(
    '这个ID你没有绑定呢',
    '绑定完你的游戏Tag再来找我',
    '这个ID号指的是你绑定小管家的TAG识别数字，请使用“绑定查询”服务查询',
    '趁我想骂你之前先核对一下有没有绑定去！',
    '不知道怎么绑定ID这也是没救了￣へ￣',
    '如果你真的不知道“@Ver.冬瓜萌萌”来帮你解决问题吧。。。。。。'
)